Tekla Open API Reference for Tekla Structures 2025
Operation.ProgressBar Class
 The ProgressBar class implements progress bar with cancel button.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Operations.Operation.ProgressBar
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class ProgressBar
Public Class ProgressBar
The Operation.ProgressBar type exposes the following members.
Constructors
Name | Description
Operation.ProgressBar
Initializes a new instance of the Operation.ProgressBar class
Top
Methods
Name | Description
Canceled
 Check if cancel has been pressed.
Close
 Close progress bar. Can be called even if Display was not successful.
Display
 Display progress bar dialog with cancel button. Display will fail if progress bar is already displayed.
SetProgress
 Update status information on the progress bar.
Top
Examples
 The following example displays progress bar, updates progress, checks if cancel has been pressed and closes the progress bar.
var progress = new Tekla.Structures.Model.Operations.Operation.ProgressBar();
bool displayResult = progress.Display(100, "title", "message", "cancel..", " ");
// looping ii from 0 to totalCount-1
{
    if (ii % 20 == 0) // progress update every 20th item
    {
        if (progress.Canceled())
        {
            break;
        }
        progress.SetProgress(ii.ToString(), 100*ii/totalCount);
    }
}
progress.Close();
See Also
Reference
Tekla.Structures.Model.Operations Namespace